Revit 2024 API
VendorIdAttribute Constructor
Constructs a new VendorIdAttribute.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public VendorIdAttribute(
	string vendorIdStr
)
Visual Basic
Public Sub New ( _
	vendorIdStr As String _
)
Visual C++
public:
VendorIdAttribute(
	String^ vendorIdStr
)
Parameters
vendorIdStr
Type: System.String
See Also
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace